{
  "_name_or_path": "google/efficientnet-b0",
  "architectures": [
    "EfficientNetForImageClassification"
  ],
  "batch_norm_eps": 0.001,
  "batch_norm_momentum": 0.99,
  "depth_coefficient": 1.0,
  "depth_divisor": 8,
  "depthwise_padding": [],
  "drop_connect_rate": 0.2,
  "dropout_rate": 0.2,
  "expand_ratios": [
    1,
    6,
    6,
    6,
    6,
    6,
    6
  ],
  "finetuning_task": "image-classification",
  "hidden_act": "swish",
  "hidden_dim": 1280,
  "id2label": {
    "0": "fermentado",
    "1": "hongo",
    "2": "insecto",
    "3": "insufi_fermen",
    "4": "pizarroso",
    "5": "violeta"
  },
  "image_size": 224,
  "in_channels": [
    32,
    16,
    24,
    40,
    80,
    112,
    192
  ],
  "initializer_range": 0.02,
  "kernel_sizes": [
    3,
    3,
    5,
    3,
    5,
    5,
    3
  ],
  "label2id": {
    "fermentado": "0",
    "hongo": "1",
    "insecto": "2",
    "insufi_fermen": "3",
    "pizarroso": "4",
    "violeta": "5"
  },
  "model_type": "efficientnet",
  "num_block_repeats": [
    1,
    2,
    2,
    3,
    3,
    4,
    1
  ],
  "num_channels": 3,
  "num_hidden_layers": 64,
  "out_channels": [
    16,
    24,
    40,
    80,
    112,
    192,
    320
  ],
  "out_features": null,
  "pooling_type": "mean",
  "problem_type": "single_label_classification",
  "squeeze_expansion_ratio": 0.25,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7"
  ],
  "strides": [
    1,
    2,
    2,
    2,
    1,
    2,
    1
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "width_coefficient": 1.0
}
